In [9]:
import pandas as pd
df_customers = pd.read_csv("/Users/marco/Desktop/ctf-labs/data science/Data/Customers.csv", sep = "|")

In [10]:
df_customers.head()

,customer_id,Gender,Date_Of_Birth,province_code,province,subscription_date
0,A0356882,M,1967-03-11,AL,Alessandria,17JUN2023
1,A0357266,M,1973-07-15,TO,Torino,05MAR2023
2,A0357328,M,1992-01-06,BA,Bari,05SEP2023
3,A0357849,M,1969-09-23,FG,Foggia,28DEC2023
4,A0358076,F,1981-03-20,CT,Catania,12APR2023

In [11]:
import pandas as pd
df_marketing = pd.read_csv("/Users/marco/Desktop/ctf-labs/jakaladata/marketing_campaigns.csv", sep = "|")

In [12]:
df_marketing.head()

  customer_id    id_nl       date open click
0    A0356882  6934159  29OCT2023    Y     N
1    A0356882  6934157  10SEP2023    N     N
2    A0356882  6934161  24MAR2024    N     N
3    A0356882  6934158  22OCT2023    N     N
4    A0356882  6934155  25JUN2023    Y     N

In [13]:
df_products = pd.read_csv("//Users/marco/Desktop/ctf-labs/jakaladata/Products.csv", sep = "|")

In [14]:
df_products.head()

   product_id               category Sub_Category gender
0      182061  Underwear & Nightwear      Pajamas  Child
1      182064                  Child         Kids  Child
2      182065                  Child      Newborn  Child
3      182066            Accessories  Accessories    Man
4      182068             Sportswear   Sportswear    Man

In [ ]:
/Users/marco/Desktop/ctf-labs/jakaladata/Transactions.csv

In [15]:
df_transactions = pd.read_csv("/Users/marco/Desktop/ctf-labs/jakaladata/Transactions.csv", sep = "|")

In [17]:
df_transactions.head()

,customer_id,Size,Quantity,Date,Payment_Method,list_price,store_channel,discount_percentage,line_amount,is_return,product_id
0,A0356882,XL,-1,03OCT2023,Card,286.0,E-commerce,0.0,-286.0,1,191533
1,A0356882,XL,1,10SEP2023,Card,286.0,E-commerce,0.0,286.0,0,191533
2,A0356882,S,1,17JUN2023,Card,258.0,E-commerce,0.0,258.0,0,195936
3,A0356882,S,-1,04JUL2023,Card,258.0,E-commerce,0.0,-258.0,1,195936
4,A0356882,M,1,26MAR2024,Card,211.0,E-commerce,0.0,211.0,0,189363